experiments/results/logs/ramp-hybrid-008/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5937.807ms, rate sampling interval: 12034ms
  Thread calibration: mean lat.: 5983.846ms, rate sampling interval: 12189ms
  Thread calibration: mean lat.: 5935.841ms, rate sampling interval: 12091ms
  Thread calibration: mean lat.: 5967.134ms, rate sampling interval: 12107ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.18s    24.38s    1.48m    82.06%
    Req/Sec    23.55     42.04   194.00     84.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.39s 
 75.000%   32.29s 
 90.000%    1.09m 
 99.000%    1.44m 
 99.900%    1.47m 
 99.990%    1.48m 
 99.999%    1.48m 
100.000%    1.48m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.506     0.000000            1         1.00
       1.911     0.100000         2699         1.11
       3.701     0.200000         5396         1.25
    4476.927     0.300000         8096         1.43
   10977.279     0.400000        10798         1.67
   16392.191     0.500000        13488         2.00
   19431.423     0.550000        14837         2.22
   22478.847     0.600000        16211         2.50
   24543.231     0.650000        17540         2.86
   27901.951     0.700000        18884         3.33
   32292.863     0.750000        20232         4.00
   37486.591     0.775000        20912         4.44
   42893.311     0.800000        21583         5.00
   48398.335     0.825000        22257         5.71
   54198.271     0.850000        22936         6.67
   59899.903     0.875000        23607         8.00
   62390.271     0.887500        23945         8.89
   65470.463     0.900000        24280        10.00
   67960.831     0.912500        24631        11.43
   71041.023     0.925000        24955        13.33
   73793.535     0.937500        25291        16.00
   74907.647     0.943750        25461        17.78
   76808.191     0.950000        25646        20.00
   78184.447     0.956250        25795        22.86
   79757.311     0.962500        25964        26.67
   80936.959     0.968750        26138        32.00
   81592.319     0.971875        26228        35.56
   82378.751     0.975000        26303        40.00
   82837.503     0.978125        26388        45.71
   83689.471     0.981250        26470        53.33
   84606.975     0.984375        26563        64.00
   84869.119     0.985938        26596        71.11
   85458.943     0.987500        26639        80.00
   85655.551     0.989062        26682        91.43
   86376.447     0.990625        26735       106.67
   86507.519     0.992188        26779       128.00
   86573.055     0.992969        26788       142.22
   86835.199     0.993750        26808       160.00
   87359.487     0.994531        26844       182.86
   87425.023     0.995313        26868       213.33
   87490.559     0.996094        26885       256.00
   87490.559     0.996484        26885       284.44
   87556.095     0.996875        26895       320.00
   87621.631     0.997266        26906       365.71
   88276.991     0.997656        26931       426.67
   88276.991     0.998047        26931       512.00
   88276.991     0.998242        26931       568.89
   88342.527     0.998437        26949       640.00
   88342.527     0.998633        26949       731.43
   88342.527     0.998828        26949       853.33
   88342.527     0.999023        26949      1024.00
   88408.063     0.999121        26962      1137.78
   88408.063     0.999219        26962      1280.00
   88408.063     0.999316        26962      1462.86
   88408.063     0.999414        26962      1706.67
   88408.063     0.999512        26962      2048.00
   88473.599     0.999561        26969      2275.56
   88473.599     0.999609        26969      2560.00
   88473.599     0.999658        26969      2925.71
   88473.599     0.999707        26969      3413.33
   88473.599     0.999756        26969      4096.00
   88539.135     0.999780        26972      4551.11
   88539.135     0.999805        26972      5120.00
   88539.135     0.999829        26972      5851.43
   88539.135     0.999854        26972      6826.67
   88539.135     0.999878        26972      8192.00
   88604.671     0.999890        26975      9102.22
   88604.671     1.000000        26975          inf
#[Mean    =    23176.809, StdDeviation   =    24382.700]
#[Max     =    88539.136, Total count    =        26975]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  27075 requests in 5.00m, 149.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 8898
  Non-2xx or 3xx responses: 24963
Requests/sec:     90.18
Transfer/sec:    508.33KB